Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM036.atdf
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow register set" name="" value="0x1" />
         <value caption="Single vector is not presented with a shadow register set" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02695" name="NVM" version="1">
      <register-group name="NVM">
         <register caption="" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="NVMOP" />
            <bitfield caption="" mask="0x00001000" name="LVDERR" />
            <bitfield caption="" mask="0x00002000" name="WRERR" />
            <bitfield caption="" mask="0x00004000" name="WREN" />
            <bitfield caption="" mask="0x00008000" name="WR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02823" name="RCON" version="">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x60" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="" mask="0x04000000" name="BCFGFAIL" />
            <bitfield caption="" mask="0x08000000" name="BCFGERR" />
            <bitfield caption="" mask="0x40000000" name="PORCORE" />
            <bitfield caption="" mask="0x80000000" name="PORIO" />
         </register>
         <register caption="" name="RSWRST" offset="0x70" rw="W" size="4">
            <bitfield caption="" mask="0x00000001" name="SWRST" />
         </register>
         <register caption="Non-Maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x80" rw="RW" size="4">
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit" mask="0x00010000" name="WDTS" values="RNMICON__WDTS" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF" />
            <bitfield caption="" mask="0x00040000" name="LVD" />
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RNMICON__GNMI" />
            <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI" />
            <bitfield caption="Run Time Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTR" values="RNMICON__WDTR" />
         </register>
         <register caption="" name="PWRCON" offset="0x90" rw="RW" size="4">
            <bitfield caption="Voltage Regulator Stand-by Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS" />
            <bitfield caption="" mask="0x00000002" name="RETEN" />
            <bitfield caption="" mask="0x00000004" name="SBOREN" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
